{
  "object-oriented": {
    "matcher": "(c\\+\\+|object.oriented| oop)",
    "text": "I am highly experienced with object-oriented programming, having taken multiple courses in <b>C</b> and <b>C++</b>. These courses have involved group projects in which I have taken the role of team lead and have also designed the structure of the entire multi-thousand line program."
  },
  "front-end-web": {
    "matcher": "(javascript|java script|coffeescript|typescript|css|html|angular|react|extension|front.end(.web)?)",
    "text": "I have considerable background in front-end web development having worked multiple jobs in the field using <b>Javascript</b>, <b>CSS</b> and <b>HTML</b>, as well as other technologies such as <b>Typescript</b>, <b>Less</b>, <b>Sass</b>, <b>AngularJS</b>, <b>React</b> and <b>Electron</b>. I also have experience building browser extensions for Google Chrome."
  },
  "back-end-web": {
    "matcher": "(ruby|rails|node|express|back.end.web)",
    "text": "At past companies I've had extensive experience writing server-side code in both <b>node.js</b> and <b>Ruby</b>, using frameworks such as <b>express.js</b>, <b>Rails</b> and <b>Sinatra</b>. I've also written servers for personal projects, as well as configuring the DNS for them."
  },
  "database": {
    "matcher": "(database|sql|migration)",
    "text": "Past jobs have had me interacting greatly with the database, including many complex <b>MySQL</b> queries, optimizing table indices"
  },
  "aws": {
    "matcher": "(aws|amazon.web.service)",
    "test": "I have used <b>Amazon Web Services</b> in past co-op jobs, particularly <b>EC2</b>, <b>ECS</b> and <b>IAM</b>, though I'm also familiar with S3, RDS, SQS, Elastic Beanstalk,ElastiCache, Kinesis, OpsWorks and CloudWatch. I've been tasked with creating new staging instances, as well as first-time setup of new microservices."
  },
  "operating-systems": {
    "matcher": "(windows|os x|mac|unix|linux|bash|shell.script)",
    "text": "At past companies I have developed on all of <b>Windows</b>, <b>OS X</b> and <b>Unix/Linux</b> environments and would consider myself comfortable coding on each of them. Through school I have learned Racket, a functional language based on Scheme, and <b>Bash</b> scripting, which I have also used in the workplace."
  },
  "version-control": {
    "matcher": "(git|github|mercurial|version.control|vcs)",
    "text": "I have worked extensively with several version control softwares such as <b>Git</b>, <b>Github</b> and <b>Mercurial</b> in the contexts of university classes, independent projects and work environments. I have also researched into these technologies for past work term reports."
  },
  "research-projects": {
    "matcher": "(research|proof.of.concept|prototype|prototyping|r\&d|r \& d)",
    "text": "At all my previous companies I have worked on research projects, quickly producing detailed proof-of-concepts for technologies such as <b>Electron</b>, <b>Aurelia</b>, <b>Parsehub</b> and the <b>Google Web Speech API</b>. At Flipp I researched a long-standing issue surrounding stale database locks and designed a solution to fix it."
  },
  "scienctific-programming": {
    "matcher": "(scienctific)",
    "text": "This term I am taking <b>Physics 239: Computational Physics</b>. Using both C++ and Octave, a free version of <b>Matlab</b>, this course teaches an object‐oriented approach to many phsyics problems, with more general methods taught as well, such as solving differential equations and Monte Carlo techniques."
  }
}